** Literate programming i Emacs
Start med ein SRC-blokk (snarveg: *<sTAB*), og fyll ut med "python :results output" for å få svaret rett under kodeblokken

 #+BEGIN_SRC python :results output
import sys
print(sys.version)
streng = "Eining for utvikling av undervising og læring"
print(len(streng))

 #+END_SRC

 #+RESULTS:
 : 3.7.0 (v3.7.0:1bf9cc5093, Jun 27 2018, 04:59:51) [MSC v.1914 64 bit (AMD64)]
 : 45

Her er ein navngitt kodeblokk for å prøve ut om eg kan vise til ting utanfor blokka:

#+NAME: aldersliste
| Namn          |   År |
|---------------+------|
| Aasmund       | 1963 |
| Johannes      | 1992 |
| Andreas       | 1995 |
| Bjørg Kristin | 1961 |

Det eg må hugse er å oppgi variabelen som "inndata". Dette er ikkje nødvendig i Jupyter.

#+BEGIN_SRC python :results output :var liste = aldersliste :exports both
for i in liste:
    print(i[0]+': '+str(2018-int(i[1])))

#+END_SRC

#+RESULTS:
: Aasmund: 55
: Johannes: 26
: Andreas: 23
: Bjørg Kristin: 57
